eisup_2019_docmng_integration/src/Enums/ВидыСтажаСЗВ4/ВидыСтажаСЗВ4.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСтажаСЗВ4</name>
  <enumValues>
    <name>ВключаетсяВСтажДляДосрочногоНазначенияПенсии</name>
  </enumValues>
  <enumValues>
    <name>ВключаетсяВСтраховойСтаж</name>
  </enumValues>
  <enumValues>
    <name>ВременнаяНетрудоспособность</name>
  </enumValues>
  <enumValues>
    <name>ОтпускБезСохраненияЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>Дети</name>
  </enumValues>
  <enumValues>
    <name>Декрет</name>
  </enumValues>
  <enumValues>
    <name>НеВключаетсяВСтраховойСтаж</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/ВидыПособийСоциальногоСтрахования/ВидыПособийСоциальногоСтрахования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПособийСоциальногоСтрахования</name>
  <enumValues>
    <name>Нетрудоспособность</name>
  </enumValues>
  <enumValues>
    <name>БеременностьРоды</name>
  </enumValues>
  <enumValues>
    <name>ПоУходуЗаРебенкомДоПолутораЛет</name>
  </enumValues>
  <enumValues>
    <name>ПриРожденииРебенка</name>
  </enumValues>
  <enumValues>
    <name>ПриПостановкеНаУчетВРанниеСрокиБеременности</name>
  </enumValues>
  <enumValues>
    <name>ВСвязиСоСмертью</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныеВыходныеДниПоУходуЗаДетьмиИнвалидами</name>
  </enumValues>
  <enumValues>
    <name>НетрудоспособностьНесчастныйСлучай</name>
  </enumValues>
  <enumValues>
    <name>НетрудоспособностьПрофзаболевание</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныйОтпускПослеНесчастныхСлучаев</name>
  </enumValues>
  <enumValues>
    <name>ПриУсыновленииРебенка</name>
    <comment>С 2007 года работодателями не выплачивается</comment>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/ВидыВремени/ВидыВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыВремени</name>
  <enumValues>
    <name>ОтработанноеВПределахНормы</name>
    <comment>Начисление за работу полную рабочую смену в пределах нормы времени</comment>
  </enumValues>
  <enumValues>
    <name>ОтработанноеСверхНормы</name>
    <comment>Начисление за работу сверх нормы времени</comment>
  </enumValues>
  <enumValues>
    <name>ЦелодневноеНеотработанное</name>
    <comment>Неотработанные полные смены</comment>
  </enumValues>
  <enumValues>
    <name>ЧасовоеНеотработанное</name>
    <comment>Неотработанные неполные смены</comment>
  </enumValues>
  <enumValues>
    <name>ДополнительноОплачиваемоеВПределахНормы</name>
    <comment>Дополнительное начисление в пределах нормы времени</comment>
  </enumValues>
  <enumValues>
    <name>ЧасовоеОтработанноеВПределахНормы</name>
    <comment>Начисление за работу неполную смену в пределах нормы времени</comment>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Catalogs/КлассификаторИспользованияРабочегоВремени/КлассификаторИспользованияРабочегоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлассификаторИспользованияРабочегоВремени</name>
  <comment>(Регл)</comment>
  <predefined>
    <items>
      <name>ВыходныеДни</name>
    </items>
    <items>
      <name>НеоплачиваемыйОтпускПоРазрешениюРаботодателя</name>
      <description>БезОпл</description>
    </items>
    <items>
      <name>НеоплачиваемыйОтпускПоЗаконодательству</name>
      <description>БезОпл</description>
    </items>
    <items>
      <name>НеоплачиваемыйДополнительныйОтпуск</name>
      <description>БезОпл</description>
    </items>
    <items>
      <name>ОтпускПоБеременностиИРодам</name>
      <description>Бер-ть</description>
    </items>
    <items>
      <name>Болезнь</name>
      <description>Болезнь</description>
    </items>
    <items>
      <name>БолезньБезОплаты</name>
      <description>Болезнь</description>
    </items>
    <items>
      <name>ДополнительныеВыходныеДниНеОплачиваемые</name>
      <description>Выход-е</description>
    </items>
    <items>
      <name>ДополнительныеВыходныеДниОплачиваемые</name>
      <description>Выход-е</description>
    </items>
    <items>
      <name>ДополнительныйОтпуск</name>
      <description>ДОтпуск</description>
    </items>
    <items>
      <name>Забастовка</name>
      <description>Забасто</description>
    </items>
    <items>
      <name>ЗадержкаВыплатыЗаработнойПлаты</name>
      <description>Задержк</description>
    </items>
    <items>
      <name>ПовышениеКвалификации</name>
      <description>Кв-ия</description>
    </items>
    <items>
      <name>ПовышениеКвалификацииВДругойМестности</name>
      <description>Кв-ия</description>
    </items>
    <items>
      <name>Командировка</name>
      <description>Ком-ка</description>
    </items>
    <items>
      <name>НеявкиПоНевыясненнымПричинам</name>
      <description>Неявки </description>
    </items>
    <items>
      <name>ОтпускНаОбучениеНеоплачиваемый</name>
      <description>Обуч-ие</description>
    </items>
    <items>
      <name>ОтпускНаОбучение</name>
      <description>Обуч-ие</description>
    </items>
    <items>
      <name>ГосударственныеОбязанности</name>
      <description>Обяз-ти</description>
    </items>
    <items>
      <name>ОсновнойОтпуск</name>
      <description>Отпуск</description>
    </items>
    <items>
      <name>ОтстранениеОтРаботыБезОплаты</name>
      <description>Отстр-е</description>
    </items>
    <items>
      <name>ОтстранениеОтРаботыСОплатой</name>
      <description>Отстр-е</description>
    </items>
    <items>
      <name>ОтпускПоУходуЗаРебенком</name>
      <description>ПоУходу</description>
    </items>
    <items>
      <name>ВынужденныйПрогул</name>
      <description>Прогул</description>
    </items>
    <items>
      <name>Прогулы</name>
      <description>Прогулы</description>
    </items>
    <items>
      <name>ПростойПоВинеРаботодателя</name>
      <description>Простой</description>
    </items>
    <items>
      <name>Простой</name>
      <description>Простой</description>
    </items>
    <items>
      <name>ПростойПоВинеРаботника</name>
      <description>Простой</description>
    </items>
    <items>
      <name>Работа</name>
      <description>Работа </description>
    </items>
    <items>
      <name>РаботаВечерниеЧасы</name>
      <description>Работа</description>
    </items>
    <items>
      <name>РаботаНочныеЧасы</name>
      <description>Работа</description>
    </items>
    <items>
      <name>Сверхурочные</name>
      <description>Работа</description>
    </items>
    <items>
      <name>Праздники</name>
      <description>Работа</description>
    </items>
  </predefined>
  <attributes>
    <name>БуквенныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦифровойКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВидВремени</name>
    <type>
      <types>EnumRef.ВидыВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееВремя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/CommonModules/ПроцедурыПерсонифицированногоУчетаПереопределяемый/Module.bsl
Функция СЗВ4_ПолучитьДополнительныеУсловияДляСотрудников(СинонимТаблицы="") Экспорт
	
	Возврат "";
	
КонецФункции //СЗВ4_ПолучитьДополнительныеУсловияДляСотрудников()

// По описанию периода времени с точки зрения учета времени и учета для ФСС
// определяем порядок включения периода в страховой стаж для назначения трудовой пенсии
//
// Параметры
//  ВидПособияСоциальногоСтрахования		- ПеречислениеСсылка.ВидыПособийСоциальногоСтрахования
//									порядок учета периода и начисленных сумм для ФСС
//  ВидВремени								- ПеречислениеСсылка.ВидыВремени
// 									характеристика периода времени
//  ОбозначениеВТабелеУчетаРабочегоВремени	- СправочникСсылка.КлассификаторИспользованияРабочегоВремени
//									код отображения периода в Табеле Т-13
//
// Возвращаемое значение:
//   ПеречислениеСсылка.ВидыСтажаСЗВ4 - характеристика периода в терминах перс.учета ПФР
//
Функция ПолучитьПорядокВключенияПериодаВСтраховойСтаж(ВидПособияСоциальногоСтрахования = Неопределено, ВидВремени = Неопределено, ОбозначениеВТабелеУчетаРабочегоВремени = Неопределено) Экспорт 
	
	ВидСтажаСЗВ4 = Перечисления.ВидыСтажаСЗВ4.ПустаяСсылка();
	
	Если ВидПособияСоциальногоСтрахования = Перечисления.ВидыПособийСоциальногоСтрахования.БеременностьРоды Тогда
		ВидСтажаСЗВ4 = Перечисления.ВидыСтажаСЗВ4.Декрет;
	ИначеЕсли ВидПособияСоциальногоСтрахования = Перечисления.ВидыПособийСоциальногоСтрахования.ПоУходуЗаРебенкомДоПолутораЛет Тогда
		ВидСтажаСЗВ4 = Перечисления.ВидыСтажаСЗВ4.Дети;
	ИначеЕсли ВидПособияСоциальногоСтрахования = Перечисления.ВидыПособийСоциальногоСтрахования.Нетрудоспособность
		ИЛИ ВидПособияСоциальногоСтрахования = Перечисления.ВидыПособийСоциальногоСтрахования.НетрудоспособностьНесчастныйСлучай
		ИЛИ ВидПособияСоциальногоСтрахования = Перечисления.ВидыПособийСоциальногоСтрахования.НетрудоспособностьПрофзаболевание Тогда
		ВидСтажаСЗВ4 = Перечисления.ВидыСтажаСЗВ4.ВременнаяНетрудоспособность;
	ИначеЕсли ВидПособияСоциальногоСтрахования = Перечисления.ВидыПособийСоциальногоСтрахования.ДополнительныеВыходныеДниПоУходуЗаДетьмиИнвалидами
		ИЛИ ВидПособияСоциальногоСтрахования = Перечисления.ВидыПособийСоциальногоСтрахования.ДополнительныйОтпускПослеНесчастныхСлучаев Тогда
		ВидСтажаСЗВ4 = Перечисления.ВидыСтажаСЗВ4.ВключаетсяВСтраховойСтаж;
	ИначеЕсли ВидВремени = Перечисления.ВидыВремени.ОтработанноеВПределахНормы Тогда
		ВидСтажаСЗВ4 = Перечисления.ВидыСтажаСЗВ4.ВключаетсяВСтажДляДосрочногоНазначенияПенсии;
	ИначеЕсли ОбозначениеВТабелеУчетаРабочегоВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ДополнительныйОтпуск
		ИЛИ ОбозначениеВТабелеУчетаРабочегоВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ДополнительныеВыходныеДниОплачиваемые
		ИЛИ ОбозначениеВТабелеУчетаРабочегоВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск Тогда
		ВидСтажаСЗВ4 = Перечисления.ВидыСтажаСЗВ4.ВключаетсяВСтажДляДосрочногоНазначенияПенсии;
	ИначеЕсли ОбозначениеВТабелеУчетаРабочегоВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Простой
		ИЛИ ОбозначениеВТабелеУчетаРабочегоВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ПростойПоВинеРаботодателя
		ИЛИ ОбозначениеВТабелеУчетаРабочегоВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучение
		ИЛИ ОбозначениеВТабелеУчетаРабочегоВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка Тогда
		ВидСтажаСЗВ4 = Перечисления.ВидыСтажаСЗВ4.ВключаетсяВСтраховойСтаж;
	ИначеЕсли ОбозначениеВТабелеУчетаРабочегоВремени = Справочники.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйОтпускПоЗаконодательству
		ИЛИ ОбозначениеВТабелеУчетаРабочегоВремени = Справочники.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйОтпускПоРазрешениюРаботодателя 
		ИЛИ ОбозначениеВТабелеУчетаРабочегоВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучениеНеоплачиваемый Тогда
		ВидСтажаСЗВ4 = Перечисления.ВидыСтажаСЗВ4.ОтпускБезСохраненияЗарплаты;
	ИначеЕсли ВидВремени = Перечисления.ВидыВремени.ЦелодневноеНеотработанное Тогда
		ВидСтажаСЗВ4 = Перечисления.ВидыСтажаСЗВ4.НеВключаетсяВСтраховойСтаж;
	ИначеЕсли ВидВремени = Перечисления.ВидыВремени.ЧасовоеНеотработанное 
		ИЛИ ВидВремени = Перечисления.ВидыВремени.ОтработанноеСверхНормы 
		ИЛИ ВидВремени = Перечисления.ВидыВремени.ЧасовоеОтработанноеВПределахНормы 
		ИЛИ ВидВремени = Перечисления.ВидыВремени.ДополнительноОплачиваемоеВПределахНормы Тогда
		ВидСтажаСЗВ4 = Перечисления.ВидыСтажаСЗВ4.ПустаяСсылка();
	КонецЕсли;
	
    Возврат ВидСтажаСЗВ4
	
КонецФункции // ПолучитьПорядокВключенияПериодаВСтраховойСтаж()

// Функция проверяет наличие доступа у пользователя к результатам начислений
//
// Возвращаемое значение:
//   Булево   - Истина, когда есть доступ
//
Функция ПроверитьНаличиеДоступаКНачислениям() Экспорт

	Возврат НастройкаПравДоступаПереопределяемый.ДоступнаРольРасчетчикаРегл();	

КонецФункции // ПроверитьНаличиеДоступаКНачислениям()

// Функция проверяет наличие доступа у пользователя к данным о стаже
//
// Возвращаемое значение:
//   Булево   - Истина, когда есть доступ
//
Функция ПроверитьНаличиеДоступаКДаннымОСтаже() Экспорт

	Возврат НастройкаПравДоступаПереопределяемый.ДоступнаРольКадровикаРегл();

КонецФункции // ПроверитьНаличиеДоступаКДаннымОСтаже()
